import os
import django

os.environ.setdefault("DJANGO_SETTINGS_MODULE", "kidhub.settings")
django.setup()

from catalog.models import Book

data = {
    77: "داستان پسری را روایت می‌کند که مادرش را بسیار بزرگ می‌بیند؛ بزرگ‌ترین مامان دنیا که وقتی وارد اتاق می‌شود همه‌جا را پر می‌کند و آغوشش برای کودک مثل یک جای امن و آرام است. اما این بزرگی فقط به اندازه جسم مادر مربوط نیست؛ داستان نشان می‌دهد هر مادری برای فرزندش به دلیل محبت، حمایت و رابطه عاطفی جایگاهی بزرگ و ارزشمند دارد. کتاب به پذیرش خود و دیگران و رابطه عاطفی کودک و مادر می‌پردازد.",

    88: "کتابی آموزشی از مجموعه مرجع پیش‌دبستانی که بر پرورش مهارت‌های زندگی کودکان تمرکز دارد. محورهای اصلی کتاب خودشناسی و برقراری ارتباط با دیگران است و موضوعاتی مانند شناخت احساسات خود و دیگران، شناخت دیگران، شناخت محیط و آداب اجتماعی را با کمک داستان، بازی و گفت‌وگو دنبال می‌کند. این کتاب همراه با کتاب راهنما ارائه شده و برای کودکان ۴ تا ۶ سال طراحی شده است."
}

for book_id, description in data.items():
    book = Book.objects.get(id=book_id)
    book.description = description
    book.save(update_fields=["description"])
    print(f"UPDATED {book_id} - {book.title}")

print(f"\nTOTAL UPDATED: {len(data)}")
